Revit 2024 API
Rebar.IsRebarFreeForm Method
 Returns true if the rebar is free form and false if shape driven.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsRebarFreeForm()
Visual Basic
Public Function IsRebarFreeForm As Boolean
Visual C++
public:
bool IsRebarFreeForm()
Return Value
 Returns true if the rebar is free form and false if shape driven.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace